{"id":8848,"date":"2020-09-21T08:32:00","date_gmt":"2020-09-21T08:32:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=8848"},"modified":"2022-10-31T11:15:38","modified_gmt":"2022-10-31T11:15:38","slug":"what-is-a-lending-institution","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/what-is-a-lending-institution","title":{"rendered":"What Is a Lending Institution?"},"content":{"rendered":"\n<p>There are several ways to get the money you need to start or grow your business, buy a car, or see you through a downtime. When all is said and done, a trusted lending institution is what most people turn to.<\/p>\n\n\n\n<p>A lending institution is an organisation that grants loans (such as personal loans, mortgages, car loans, debt consolidation loans, business loans, rent loans and loan facilities) to individuals and corporate entities based on the borrower’s creditworthiness. The types of loans offered depend on the structure of the financial institution.<\/p>\n\n\n\n<p>An interest rate is charged on the funds according to the risk the lender has to bear – the higher the chances of running a bad debt, the higher the cost of the loan. Other fees may also apply.<\/p>\n\n\n\n<p>The borrower agrees to certain repayment terms as stipulated in a contract.<\/p>\n\n\n\n<p>However, not all lending institutions are focused on making a profit. Some, such as credit unions, are non-profit and offer funds to their members at a low cost.<\/p>\n\n\n\n<h3>Types of Lending Institutions<\/h3>\n\n\n\n<p>Different lending institutions specialise in different services and have varied conditions for giving out capital.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Therefore, we’ll take a look at some of them so that you can make an informed choice when going for a loan.<\/p>\n\n\n\n<p>Lending institutions can be broadly grouped into depository and non-depository institutions.<\/p>\n\n\n\n<p>A depository institution holds deposits from its customers for safekeeping and provides fund transfer services. They use the pooled cash to offer loans and make other investments. Examples include commercial banks, internet banks, savings and loans, and credit unions. &nbsp;&nbsp;<\/p>\n\n\n\n<p>Non-depository lending institutions do not hold deposits. Brokerage firms are a good example.<\/p>\n\n\n\n<ul><li><strong>Commercial Banks:<\/strong> Commercial Banks are for-profit corporations and are regulated by the Central Bank of Nigeria (CBN). Because they offer several other services apart from making secured and unsecured loans, borrowers tend to turn to commercial banks as the lending institution of choice, especially when they have a deposit with the said bank.<\/li><li><strong>Internet Banks:<\/strong> Since Internet Banks run their operations solely online and do not have any physical structures, they keep their overheads low. This enables them to give attractive interest rates on both loans and deposits.<\/li><li><strong>Savings and Loans:<\/strong> Although Savings and Loans companies have different procedures and ownership structure, they offer many of the same services as commercial banks. However, they tend to provide more competitive rates for loans and deposits and focus more on residential mortgages.<\/li><li><strong>Credit unions:<\/strong> These are non-profit cooperative financial institutions that are established and managed by its members, who have equal privileges and responsibilities. Only members can make deposits, access loans (at low-interest rates), and cast a vote during the election of committee members and board of directors. The National Co-operative Financing Agency of Nigeria (CFAN) serves as the Apex Association Body for credit unions.<\/li><li><strong>Brokerage firms:<\/strong> Known for the trading of securities, brokerage firms provide margin loans that allow borrowers to take advantage of market opportunities. The investments made with the borrowed funds are domiciled with the lender and serve as collateral. Brokerage firms are regulated by the Securities and Exchange Commission (SEC).<\/li><\/ul>\n\n\n\n<p>Other types of lending institutions include mortgage companies and payday loan companies.<\/p>\n\n\n\n<p>It is important to choose the right kind of lending institution when going for a loan.<\/p>\n\n\n\n<p>Take the time to find out the type of loan that will suit your needs and make sure you compare the fees, interest rates, interest compounding, and the terms and conditions stipulated in the loan agreement.<\/p>\n\n\n\n<p>Considering all your options will enable you to get the best rates and avoid running into problems that may affect your credit history.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are several ways to get the money you need to start or grow your business, buy a car, or<\/p>\n","protected":false},"author":2,"featured_media":8850,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8848"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=8848"}],"version-history":[{"count":2,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8848\/revisions"}],"predecessor-version":[{"id":8851,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8848\/revisions\/8851"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/8850"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=8848"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=8848"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=8848"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}