{"id":8852,"date":"2020-09-21T08:32:00","date_gmt":"2020-09-21T08:32:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=8852"},"modified":"2022-10-31T11:15:33","modified_gmt":"2022-10-31T11:15:33","slug":"10-ways-to-get-out-of-debt-faster-in-nigeria","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/10-ways-to-get-out-of-debt-faster-in-nigeria","title":{"rendered":"10 Ways to Get Out of Debt Faster in Nigeria"},"content":{"rendered":"\n<p>It’s so easy to get into debt but challenging to get out. Sometimes, it only takes a few minutes to create millions of Naira in debt and years to pay off.<\/p>\n\n\n\n<p>Perhaps you’ve tried several strategies to get out of debt but only found yourself sinking deeper. In this article, we’ll share practical tips you can implement immediately to wipe off your debt profile and start building wealth today.<\/p>\n\n\n\n<h2>1.&nbsp;&nbsp;&nbsp; Find Out How Much Debt You Have<\/h2>\n\n\n\n<p>Determining how much you owe is the first step to creating a plan. Many people waste money by skipping this step.<\/p>\n\n\n\n<p>The truth is people would rather look away than confront the reality of the situation. Credit and loan companies want you to send them the minimum payment every month. That’s how they make money. What you don’t realise is that minimum payments prevent you from getting out of debt.<\/p>\n\n\n\n<p>Call the&nbsp;lending institution&nbsp;and ask them for the amount you owe, the annual interest rate and the monthly minimum payment on the loan. It’s easier to develop a strategic plan when you know how much you owe.<\/p>\n\n\n\n<h2>2.&nbsp;&nbsp;&nbsp; Create a Debt Payment Plan<\/h2>\n\n\n\n<p>You need a plan of action to keep you focused on your debt repayment. A debt payment plan helps you channel all your extra funds towards paying off your debt faster.<\/p>\n\n\n\n<p>You also have a system to track how much you make, how much you spend, and how much you’ve paid off.<\/p>\n\n\n\n<h2>3.&nbsp;&nbsp;&nbsp; Don’t take on Any More Debt<\/h2>\n\n\n\n<p>If you’re paying off the loan you took for your children’s school fees, house rent or&nbsp;car loan, do not accumulate more debt until you’ve fully paid off your debt.<\/p>\n\n\n\n<p>You won’t make any progress if you keep adding to the debt you’re paying off. If you have a bank credit card, tear it up.<\/p>\n\n\n\n<p>Only use one debit card for emergencies and unforeseen expenses. You’ve got to learn financial discipline if you want to pay off and stay out of debt.<\/p>\n\n\n\n<h2>4.&nbsp;&nbsp;&nbsp; Pay More Than the Minimum<\/h2>\n\n\n\n<p>As earlier stated, paying more than the minimum ensures you finish paying off your debt faster. For instance, if you take a personal loan of ₦3million at 28% per annum, that’s 2.3% monthly interest rate. Instead of paying ₦70,000 a month, you could increase payment to ₦100,000 a month.<\/p>\n\n\n\n<p>Rather than paying back the loan over 2-3 years, you can pay it back more quickly. Unlike most countries, Nigerian banks wave the penalty for early loan repayment (usually for personal loans). You speed up the payoff and save on interest of the lifespan of the loan.<\/p>\n\n\n\n<h2>5.&nbsp;&nbsp;&nbsp; Create an Emergency Fund<\/h2>\n\n\n\n<p>We don’t want accidents or emergencies, but they do happen. It may seem counterintuitive to set up an emergency fund when you’re trying to get out of debt, but it prevents you from creating more debt.<\/p>\n\n\n\n<p>Knowing that you have a safety net, comes in handy during an emergency such as a mass layoff, unpaid sick leave or other events. The ideal emergency account has up to six months of living expenses saved up.<\/p>\n\n\n\n<h2>6.&nbsp;&nbsp;&nbsp; Live on a Bare Bones Budget<\/h2>\n\n\n\n<p>Love going out on Friday nights, eating lunch at your favourite restaurant every day or shopping at luxury stores? Stop it. You must cut your expenses if you want to pay down debt faster.<\/p>\n\n\n\n<p>A bare-bones budget forces you to live on the minimum living allowance. Avoid luxuries. Instead of DSTV choose GOTV. Don’t buy lunch at work, rather, cook at home.<\/p>\n\n\n\n<p>You’ll have more to pay towards your debt when you live on a stringent budget. As you get closer to your goal, you can add inexpensive luxuries back into your monthly budget.<\/p>\n\n\n\n<h2>7.&nbsp;&nbsp;&nbsp; Avoid Debt Settlement Organisations<\/h2>\n\n\n\n<p>These companies work with lenders to negotiate charge offs and attractive terms. It sounds good in theory but usually doesn’t work well in practice.<\/p>\n\n\n\n<p>Debt settlement companies have expensive overhead fees. Also, lenders are usually unwilling to work with them. You should contact your account officer or bank manager and negotiate with them directly.<\/p>\n\n\n\n<h2>8.&nbsp;&nbsp;&nbsp; Negotiate a Lower Interest Rate with Your Bank<\/h2>\n\n\n\n<p>Do you feel overwhelmed when you think of your debt profile? Terrified that it may take a decade to pay back what you owe? You can save money by jumping on a call with your lenders.<\/p>\n\n\n\n<p>A simple negotiation with your account officer could lower the annual interest rate on your loan. Tell them that you plan to use an aggressive approach to pay off your debt and you’re hoping they reconsider lowering the loan interest rate.<\/p>\n\n\n\n<p>However, you may have to visit the bank in person to meet with the manager if you want a positive response.<\/p>\n\n\n\n<h2>9.    Get a Side Hustle<\/h2>\n\n\n\n<p>You probably have skills you’re not utilising or underutilising. How about monetising them to make money?<\/p>\n\n\n\n<p>For instance, if you work a 9-5 job, you could take on a side job on the weekends. There are many jobs online if you look carefully.<\/p>\n\n\n\n<p>Perhaps writing is your gift, or you type fast. Do you design and develop websites at work? You could pick up a freelance gig on the weekend or do administrative work.<\/p>\n\n\n\n<p>There are many options when you think of how you can apply your skills. Google “Freelance + your skill” to get started.<\/p>\n\n\n\n<p>For instance, if you want to offer bookkeeping services, Google “Freelance Bookkeeper.” Options include&nbsp;<a href=\"https:\/\/www.upwork.com\/\" target=\"_blank\" rel=\"noopener\">Upwork<\/a>,&nbsp;<a href=\"https:\/\/www.peopleperhour.com\/\" target=\"_blank\" rel=\"noopener\">PeoplePerHour<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.fiverr.com\/\" target=\"_blank\" rel=\"noopener\">Fiverr<\/a>.<\/p>\n\n\n\n<p>Alternatively, you could pick up a seasonal job. For instance, during Christmas, many events take place throughout the country. Tourists usually visit during summer and hotels hire temporary workers to manage the workflow. The extra cash will go towards paying off your debt.<\/p>\n\n\n\n<h2>10.&nbsp; &nbsp; Be Accountable to Someone Else<\/h2>\n\n\n\n<p>Sometimes, it takes a team effort to get out of debt. It’s not enough to create a budget or debt repayment plan.<\/p>\n\n\n\n<p>Schedule monthly meetings with your accountability partner to access if you’re on track. Having an accountability partner gives you the extra nudge you need to stay focused on your savings goals.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>The temptation to take on new debt after you’ve finished repaying an old debt is not easy to overcome. Read through the fine prints and determine if you need a loan. Only take on debt when it’s absolutely necessary such as paying house rent, school fees, a mortgage or a business loan.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s so easy to get into debt but challenging to get out. Sometimes, it only takes a few minutes to<\/p>\n","protected":false},"author":2,"featured_media":8853,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8852"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=8852"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8852\/revisions"}],"predecessor-version":[{"id":8854,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8852\/revisions\/8854"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/8853"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=8852"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=8852"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=8852"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}