{"id":8855,"date":"2020-09-21T08:37:00","date_gmt":"2020-09-21T08:37:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=8855"},"modified":"2022-10-31T11:15:28","modified_gmt":"2022-10-31T11:15:28","slug":"types-of-loan-fees","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/types-of-loan-fees","title":{"rendered":"Loan Fees in Nigeria, what types are there?"},"content":{"rendered":"\n<h2>Types of Loan Fees in Nigeria that can be Charged by Lenders<\/h2>\n\n\n\n<p>Have you ever applied for a loan without asking for a full disclosure of fees?<\/p>\n\n\n\n<p>In such a scenario, you might end up having problems paying back the funds if the cost is much more than you expected.<\/p>\n\n\n\n<p>Perhaps after the fees are deducted, the final loan amount you receive won’t be enough for the purpose you want it to serve.<\/p>\n\n\n\n<p>Therefore, when going for different types of loans (Payday loans,&nbsp;Refinancing loans,&nbsp;&nbsp;Car loans,&nbsp;Rent loans&nbsp;and more), learning about the fees you might be required to pay upfront, within the tenure, and at payoff can help you weigh your options and determine your borrowing capacity.<\/p>\n\n\n\n<p>You can then adequately compare the offers from various lenders and pick the one that best suits your needs.<\/p>\n\n\n\n<h2>What are Loan Fees?<\/h2>\n\n\n\n<p>Loan fees are fees which are charged for borrowing money from a lending institution. It is entirely separate from the interest rate.<\/p>\n\n\n\n<p>These fees vary from lender to lender and also depend on your qualifications as a borrower, the type of loan, loan amount, and repayment terms negotiated.<\/p>\n\n\n\n<p>Loan fees in Nigeria are charged for a number of reasons, some of which include covering the costs of reviewing, processing, paying out, and managing the loan.<\/p>\n\n\n\n<p>Below are listed the common types of loan fees and what they are for.<\/p>\n\n\n\n<h3>Fees for Loan opening and Release of funds<\/h3>\n\n\n\n<p>These apply before your loan is granted and disbursed: &nbsp;&nbsp;<\/p>\n\n\n\n<h3>1. <strong>Application \/ Processing Fees<\/strong><\/h3>\n\n\n\n<p>Depending on the lender, an application fee may be paid upfront by a potential borrower just to set things in motion.<\/p>\n\n\n\n<p>Since a lot of work goes into determining whether or not you qualify for a loan, the application fee is meant to compensate the lender for the expertise, time, and effort. Some charge a flat rate while others set the fee as a percentage of the loan amount.<\/p>\n\n\n\n<p>The fee is non-refundable even if the loan is denied.<\/p>\n\n\n\n<p>Credit Nigeria does not recommend upfront payment of processing fees. Most reputable lending institutions charge a processing fee after the loan has been granted.<\/p>\n\n\n\n<h3><strong>2. Origination Fee<\/strong><\/h3>\n\n\n\n<p>These apply after your loan has been processed and approved. It is calculated as a percentage of the amount borrowed and is deducted before the funds are transferred to you. The fee is indicated in your Annual Percentage Rate (APR).<\/p>\n\n\n\n<p>Not all lenders charge an origination fee. For those that do, it is non-negotiable.<\/p>\n\n\n\n<h2><strong>Administrative fees<\/strong><\/h2>\n\n\n\n<p>During the tenure of your loan, the lender can charge a number of fees to cover the cost of maintenance. These loan fees in Nigeria include:<\/p>\n\n\n\n<h3><strong>1. Annual Fee<\/strong><\/h3>\n\n\n\n<p>These are charged once a year. The amount may be negotiable so make sure to discuss with your lender.<\/p>\n\n\n\n<h3><strong>2. Ongoing Administration Fees<\/strong><\/h3>\n\n\n\n<p>These come in different forms, including monthly fees, loan service fees, payment by check fees, payment convenience fees among others.<\/p>\n\n\n\n<p>Most of them are negotiable so make sure to discuss with your lender and determine the ones that can be dropped entirely.<\/p>\n\n\n\n<h2><strong>Repayment fees<\/strong><\/h2>\n\n\n\n<p>These are costs that are incurred while repaying your loan.<\/p>\n\n\n\n<h3><strong>1. Prepayment Fee<\/strong><\/h3>\n\n\n\n<p>Also called an Exit Fee, prepayment fees are charged when you decide to pay off your loan before the tenure is due.<\/p>\n\n\n\n<p>Early payment reduces the interest that would have accrued over the lifetime of the loan. Thus the lender issues a penalty to compensate for the loss.<\/p>\n\n\n\n<p>To avoid this fee, confirm with your lender whether prepayments are against the terms of the loan.<\/p>\n\n\n\n<h3><strong>2. Late Payment Fee:<\/strong><\/h3>\n\n\n\n<p>These are charged every time you fail to make your monthly payment in full and on time. Some lenders will give a grace period before considering your account delinquent and applying the fee.<\/p>\n\n\n\n<p>Late payment fees are either a flat fee or calculated as a percentage of the due amount.<\/p>\n\n\n\n<p>Opting for the money to be automatically deducted from your bank account when your payment is due is a good way to avoid late fees.<\/p>\n\n\n\n<p>If you suspect that you won’t be able to make a payment on time, contact your lender and see if some sort of arrangement can be made.<\/p>\n\n\n\n<h3><strong>3. Non-sufficient Funds Fee (NSF)<\/strong><\/h3>\n\n\n\n<p>If a payment is unsuccessful because your bank account cannot be accessed or there are not enough funds, you will have to pay an NSF fee.<\/p>\n\n\n\n<p>This flat fee is also known as failed payment, returned check, or returned payment fee.<\/p>\n\n\n\n<h2><strong>Conclusion<\/strong><\/h2>\n\n\n\n<p>Every loan you apply for comes with a specific set of fees. These depend on the lender, your borrowing qualifications, the loan type and amount, and the repayment terms.<\/p>\n\n\n\n<p>Lenders often provide an Annual Percentage rate (APR) for their loan products to spell out the full cost to the borrower, including the interest rate and all required fees. APRs are therefore important when comparing the loan offer from different lenders.<\/p>\n\n\n\n<p>But keep in mind that the APR calculation assumes you will make your payments in full and on time and therefore might not include some fees such as NSF (Non-Sufficient funds) and late payment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Types of Loan Fees in Nigeria that can be Charged by Lenders Have you ever applied for a loan without<\/p>\n","protected":false},"author":2,"featured_media":8857,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8855"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=8855"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8855\/revisions"}],"predecessor-version":[{"id":8856,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8855\/revisions\/8856"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/8857"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=8855"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=8855"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=8855"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}