{"id":8861,"date":"2020-09-21T08:41:00","date_gmt":"2020-09-21T08:41:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=8861"},"modified":"2022-10-31T11:15:16","modified_gmt":"2022-10-31T11:15:16","slug":"what-does-it-mean-to-default-on-a-loan","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/what-does-it-mean-to-default-on-a-loan","title":{"rendered":"What Does It Mean to Default on a Loan?"},"content":{"rendered":"\n<p>Have you ever taken business or personal loans from a financial institution? Then you must have accepted some terms, including an interest rate, loan tenure, and monthly or yearly fees.<\/p>\n\n\n\n<p>Although you took on the debt with good intentions, some unforeseen circumstance might prevent you from meeting your repayment obligations.<\/p>\n\n\n\n<p>In the case of late payments (referred to as a delinquency), the lender charges you a fine. But the worst-case scenario is when you do not pay back at all.<\/p>\n\n\n\n<p>A default is the failure to service your loan, forcing the creditor to take legal action against you.<\/p>\n\n\n\n<p>The delay period and the number of missed scheduled payments before you are considered a defaulter depends on the lender.<\/p>\n\n\n\n<h2>What Happens When You Default on a Loan?<\/h2>\n\n\n\n<p>When you take a loan, you sign an agreement that stipulates what will happen if you fail to pay back.<\/p>\n\n\n\n<p>For a secured loan like mortgage and auto loans, your house or car serves as collateral.<\/p>\n\n\n\n<p>But for unsecured loans, where there’s no asset to be seized and sold by the lender in order to recover the money, there are other measures that could be taken:<\/p>\n\n\n\n<p>1. The lender looks for reputable third-party collection agencies and hires one to help them recover the funds. After you pay, the agency collects a percentage.<\/p>\n\n\n\n<p>2. Legal proceedings will be initiated against you, according to the terms of the contract.&nbsp;<\/p>\n\n\n\n<p>3. In line with the credit risk protection clause, decreed by The Central Bank of Nigeria (CBN), your Bank Verification Number (BVN) and Tax Identification Number (TIN) enable the lender to settle the loan with deposits you have in accounts across the banking industry.<\/p>\n\n\n\n<h2>What Are The Consequences?<\/h2>\n\n\n\n<p>Before a financial institution disburses funds, they consult at least two credit bureaus to obtain your credit report and determine whether or not you are creditworthy.<\/p>\n\n\n\n<p>The CBN has licensed three credit bureaus: XDS Credit Bureau, Credit Registry, and CRC Credit Bureau. After you have received a loan and fail to repay, the lender reports the default to them. This has a negative effect on your credit history, making it difficult for you to get another loan from any financial institution.<\/p>\n\n\n\n<h2>What to Do If You are Having Problems Repaying a Loan<\/h2>\n\n\n\n<p>It is advisable to take action before you become late on your payments.<\/p>\n\n\n\n<p>Rather than default on a loan, there are several things you can do: <\/p>\n\n\n\n<p><strong>1. Discuss with the lender and work out a solution:<\/strong> It is better to let them know your status than to go incommunicado. They might have an alternative that will help you, such as shifting your due date. You could also offer to pay the amount you have at the moment and settle the balance later. <\/p>\n\n\n\n<p><strong>2. Ask the Bank for a Moratorium:<\/strong>&nbsp;This allows you a limited period of time within which you suspend repaying the principal and only settle the accruing interests.&nbsp;<\/p>\n\n\n\n<p><strong>3. Consolidate or Refinance the loan:<\/strong>&nbsp;These two terms have a somewhat similar effect but are quite different. When you have several loans that will soon be due, it is often difficult to keep track of the different repayment plans. Thus, you may miss your payments or even default.But consolidating them into a single debt makes it easy for you to remember your due date. It also lowers your monthly payments and overall interest rate.Refinancing, on the other hand, is when you apply for a new loan to pay off an existing one. It enables you to get a better deal.<\/p>\n\n\n\n<p><strong>4. Delay the payment:<\/strong> It is better to delay payment than not to pay at all. However, keep in mind that exceeding your deadline means you will owe more money as you accrue interest charges, fees, and penalties.<\/p>\n\n\n\n<h2>Summary<\/h2>\n\n\n\n<p>Loan default is when you have failed to honour the obligation of paying back your debt.<\/p>\n\n\n\n<p>When you are behind on your payment, the situation is regarded as a delinquent and you are charged late fees. The period of time that passes before you are considered a defaulter depends on the lender.<\/p>\n\n\n\n<p>If the agreement involves paying back in instalments, the lender considers you a defaulter when you miss successive payments.<\/p>\n\n\n\n<p>On failing to pay back a loan, the lender informs the credit bureau and it takes a toll on your creditworthiness. They also apply several measures to recoup their funds.<\/p>\n\n\n\n<p>Rather than default on a loan, ensure that you take the necessary actions to prevent tarnishing your credit history.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever taken business or personal loans from a financial institution? Then you must have accepted some terms, including<\/p>\n","protected":false},"author":2,"featured_media":8863,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8861"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=8861"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8861\/revisions"}],"predecessor-version":[{"id":8862,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8861\/revisions\/8862"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/8863"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=8861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=8861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=8861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}