{"id":8864,"date":"2020-09-21T08:44:00","date_gmt":"2020-09-21T08:44:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=8864"},"modified":"2022-10-31T11:15:11","modified_gmt":"2022-10-31T11:15:11","slug":"what-is-inflation","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/what-is-inflation","title":{"rendered":"What is Inflation?"},"content":{"rendered":"\n<p>If you are someone with a good grasp of the Nigerian finance history, you would agree with us that 1 Naira was once equivalent to 1 US Dollar, but now a USD is worth around 360 Naira. What did you think was wrong with the Nigerian economy when the price of a “congo” (cup) of rice rose from 50 Naira to as high as 500 Naira in 2016? As a matter of fact, during the regime of President Goodluck Jonathan, the Central Bank of Nigeria proposed a bill to introduce a higher currency of&nbsp;₦5,000 (Five Thousand Naira Note – which was later rebuffed by the then president) into the economy to help reduce this increasing economic problem. What then is this increasing economic problem?<\/p>\n\n\n\n<p>This economic issue is called inflation, a persistent or consistent increase in the general or average price of commodities and services in an economy within a course of time. In other words, inflation involves a gradual decrease in the purchasing strength or value of a country’s currency over a period of time. This type of economic dilemma comes in different types and is usually measured\/represented in rates or percentages.<\/p>\n\n\n\n<h2>History of Inflation In Nigeria<\/h2>\n\n\n\n<p>Before the discovery of crude oil in Nigeria in the year 1956, the country’s economy survived majorly on the trade of agricultural products such as cocoa, cassava, and kola nut. The discovery of oil resulted in a huge influx of money into the country’s treasury to the extent that Yakubu Gowon (a former Nigerian head of state) said that “money is not Nigeria’s problem, but how to spend it.”<\/p>\n\n\n\n<p>The Nigerian economy started to experience a form of rising inflation in 1982 when the demand for crude oil in the global market dropped dramatically. And although Nigeria was and still is the highest producer of crude oil among the Organisation of the Petroleum Exporting Countries (OPEC), the constant fall in the price of crude oil in the foreign market continues to leave the economy of Nigeria in a struggling state.<\/p>\n\n\n\n<p>Furthermore, the price of commodities such as rice, garri, beans, and other food items started to rise over time, such that a “congo” (a cup) of rice which used to be 50 Naira rose to as high as 600 Naira in 2015\/2016. Petrol also which was sold around 20 Naira per litre in 1999 rose to&nbsp;₦500+ in 2015\/2016, and is now sold at 147 Naira per litre today.&nbsp;<\/p>\n\n\n\n<h5><\/h5>\n\n\n\n<h2>Types of Inflation<\/h2>\n\n\n\n<p>Inflation comes in different forms or types, some of which include creeping Inflation, Hyperinflation, Galloping Inflation, Walking Inflation, Core Inflation, Stagflation, Deflation, Asset Inflation, Wage Inflation, and many more. However, we are going to discuss on the following 3 as they have more direct relevance to the Nigerian situation.<\/p>\n\n\n\n<ul><li><strong>Hyperinflation:<\/strong>&nbsp;This involves an unusually fast increase in the price of goods and services in an economy, it is a rapid form of inflation. As shown earlier, Nigeria experienced this the most in 2015\/2016 when the price of petrol became so unbearable and the prices of goods and services skyrocketed as a result.<\/li><\/ul>\n\n\n\n<ul><li><strong>Deflation:<\/strong>&nbsp;This simply refers to a drastic reduction in the price of goods and services in an economy, it is a direct opposite of inflation.<\/li><li><strong>Stagflation:<\/strong>&nbsp;This refers to a case of inflation in an economy that has continued for a long period of time in a stagnant state. This is the current state of the Nigerian economy as a lot of service and commodity prices stayed at the inflated price, take for example a sachet of water popularly known as “pure water” which used to be 5 Naira is still sold at 10 Naira.<\/li><\/ul>\n\n\n\n<h2>Factors of Inflation<\/h2>\n\n\n\n<p>Several schools of thought exist as regards the factors that cause inflation, however, the most popular is the Monetarist and the Keynesian.<\/p>\n\n\n\n<h5><\/h5>\n\n\n\n<h2>Keynesian School<\/h2>\n\n\n\n<p>The Keynesian theory states that the major causes of inflation are demand and cost of commodity pressures, these are otherwise known as Demand-Pull Inflation and Cost-Push Inflation.<\/p>\n\n\n\n<ul><li><strong>Demand Pressure:<\/strong> This occurs where the aggregate demand for goods or services surpass the aggregate supply. A good example is the chronic effect of fuel scarcity is in Nigeria, the demand for this commodity rises above the available supply, thereby making the cost of related services rise too. The most notable example is the cost of transportation and logistics.<\/li><li><strong>Cost-Push:<\/strong> This occurs where the factors of productions (such as land, capital, labour, etc) become really expensive to procure. This factor almost brought the Nigerian economy to its knees in 2016 when the price of petrol increased to 500 Naira per litre. It resulted in a situation whereby companies that rely on the use of petrol for their businesses increased the price of their products – a sachet of water (pure water) increased from ₦5 to ₦10 and has not gone down ever since. A big bottle of Coca-Cola which used to be ₦50 became ₦100, several scenarios abound.<\/li><\/ul>\n\n\n\n<h2>Monetarist School<\/h2>\n\n\n\n<p>The Monetarist school believes that the supply of money into a country’s economy determines it’s inflation rate. To the monetarists, the only way to curb inflation is to prudently manage the supply of money. This theory was realised to an extent in Nigeria during the post-oil boom era when the reduction in the inflow of money resulted in rising inflation in the economy.<\/p>\n\n\n\n<h2>Inflation Rate<\/h2>\n\n\n\n<p>As we mentioned earlier, the status of inflation in an economy is measured in rates, and as of May 2019, the annual consumer price inflation in Nigeria was calculated at 11.40%. Although this has dropped to 11.22% in June, there is still a likelihood of increase.<\/p>\n\n\n\n<h2>Curbing the Adverse Effects of Inflation<\/h2>\n\n\n\n<p>Inflation has the tendencies of destroying a country’s economy if adequate measures are not employed by the government to curb it. Inflation control measures include:<\/p>\n\n\n\n<ul><li><strong>Fiscal Policies<\/strong>:&nbsp;In this case, the government reduces revenue spending and imposes a higher form of taxation on incomes. This can be seen in the introduction of the value-added tax (VAT) of 5% on luxury items and services in Nigeria. It can also be seen in the very much recent introduction by the CBN (Central Bank of Nigeria) of addition charges (3% on individuals, 5 % on corporate entities) on banking transaction of 500,000 Naira and above – a policy which took effect on the 18th of September 2019. The aim of which is to increase the economic strength of the Nigerian economy.<\/li><li><strong>Price Control:<\/strong>&nbsp;In this case, a proper investigation is done on whether to increase or reduce the price of commodities, bearing in mind that the higher the price, the lower the demand.<\/li><\/ul>\n\n\n\n<ul><li><strong>Monetary Measures:<\/strong>&nbsp;This is done by setting interest rates, the government simply increases interest rates to reduce demand until the economy is balanced.<\/li><li><strong>Privatisation:<\/strong>&nbsp;Privatisation of public utility companies can help to curb inflation. Take, for example, the privatisation of the telecommunication sector in Nigeria created a competitive atmosphere, thereby reducing the cost of data and voice calls to a bearable level. It is funny to realise that a sim card which used to cost about 30,000 Naira is now worth almost nothing, some networks even give out sim cards for free.<\/li><\/ul>\n\n\n\n<h2>Recap<\/h2>\n\n\n\n<p>This article centres on the subject matter of Inflation especially as it relates to Nigeria. We discussed the history of inflation in Nigeria, the types of inflation in Nigeria, schools of thoughts regarding factors that cause inflation in Nigeria, the current inflation rate, and potent measures that can be used by the government to keep inflation in check.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are someone with a good grasp of the Nigerian finance history, you would agree with us that 1<\/p>\n","protected":false},"author":2,"featured_media":8866,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8864"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=8864"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8864\/revisions"}],"predecessor-version":[{"id":8865,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/8864\/revisions\/8865"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/8866"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=8864"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=8864"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=8864"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}