{"id":9642,"date":"2020-12-29T12:57:00","date_gmt":"2020-12-29T12:57:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=9642"},"modified":"2022-10-31T11:14:46","modified_gmt":"2022-10-31T11:14:46","slug":"types-of-interest-rates-in-nigeria","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/types-of-interest-rates-in-nigeria","title":{"rendered":"Types of Interest Rates in Nigeria &#8211; Explanation and Examples"},"content":{"rendered":"\n<p>There are numerous reasons why one may consider taking a loan – Be it shopping for a new car, having a line of credit to fall back on during dry spells, paying for school, you name it.<\/p>\n\n\n\n<p>And true, there are online lenders beyond counting that entice you with quick-access collateral-free loans. The advertised interest rates are often so attractive that you think to yourself, &#8216;Hey, I can handle it.&#8217;<\/p>\n\n\n\n<p>But what you might not know is that some loan offers could be too good to be true. Why? Because interest rates can be presented in more than one way, meaning that there&#8217;s a lot in the background that the lender might not be telling you just yet.<\/p>\n\n\n\n<p>So, if you don&#8217;t do your homework, you commit to a loan that you soon find difficult to settle. Even if you can pay back, you wind up spending more than you could have, assuming you got a better deal.<\/p>\n\n\n\n<p>To make better choices, you need to get familiarised with these terms:<\/p>\n\n\n\n<ul><li>Nominal interest rate<\/li><li>Effective interest rate<\/li><li>Annual Percentage Rate (ARP)<\/li><\/ul>\n\n\n\n<p>They are different types of interest rates.<\/p>\n\n\n\n<p>Let&#8217;s get started.<\/p>\n\n\n\n<h2>What is nominal interest rate?<\/h2>\n\n\n\n<p>NIR is the interest rate you might be used to already. It is the one often found on financial institution profiles and loan adverts. It is also known as the base rate or coupon rate. NIR does not account for inflation or compounding.<\/p>\n\n\n\n<p>But once the figure adjusts for inflation or compounds, there will be a significant increase in your interest payments.<\/p>\n\n\n\n<p><strong>Note:<\/strong>&nbsp;Compounding means that the accrued interest is added to the principal, making you pay interest on the interest. It has a snowball effect, which is very favourable for investors. But for borrowers, it can be quite unpleasant.<\/p>\n\n\n\n<h2>What is effective interest rate?<\/h2>\n\n\n\n<p>Effective interest rate is what you have when the lender takes compounding into account. It is also known as the market rate of interest, yield to maturity, or annual percentage yield (APY).<\/p>\n\n\n\n<p>The gap between the nominal and effective interest rates increases proportionately to the number of compounding periods within the tenure of your loan.<\/p>\n\n\n\n<p>For example, Lender A offers a loan with a nominal interest rate of 8% and compounds every six months. Their offer will be more expensive than Lender B, whose nominal interest rate is also 8% but compounds annually.<\/p>\n\n\n\n<p>Although they both have the same nominal interest rate of 8%, the effective interest rate of Lender A is much higher, and considerably so if you are going for a long term loan and a significant amount of money.<\/p>\n\n\n\n<h2>What is annual percentage rate (APR)?<\/h2>\n\n\n\n<p><a href=\"https:\/\/creditnigeria.com\/interest-rate-apr-difference\">APR<\/a>&nbsp;is interest repaid in a year along with any fees that the loan attracts. It can also be nominal or effective.<\/p>\n\n\n\n<p>Nominal APR is the coupon\/base rate you would repay in a year if the lender doesn&#8217;t factor in compounding. Effective APR adjusts for compounding.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>When shopping for a loan, you need to be more mindful as you compare lenders. The differences between nominal, effective, and annual percentage rates have a significant impact that should not be taken lightly.<\/p>\n\n\n\n<p>A loan that compounds, say monthly, will be more expensive than another that compounds annually. Likewise, a loan that charges more fees, such as application fees, maintenance fees, late payment fees, and so on, will have a higher APR than one that charges considerably lower fees.<\/p>\n\n\n\n<p>Ensure that you do some due diligence before committing to a loan, no matter how urgently it is needed. It will help save you some trouble down the road and keep your credit score blemish-free.<\/p>\n\n\n\n<p>If you need help comparing loans, you can always go through <a href=\"\/\">Credit Nigeria<\/a>. It is an online loan marketplace that links you to several lenders based on your profile. You learn all the details about the available loan offers so that you can make an informed choice. This service is without obligations or hidden fees.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are numerous reasons why one may consider taking a loan – Be it shopping for a new car, having<\/p>\n","protected":false},"author":2,"featured_media":9643,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9642"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=9642"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9642\/revisions"}],"predecessor-version":[{"id":9644,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9642\/revisions\/9644"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/9643"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=9642"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=9642"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=9642"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}