{"id":9645,"date":"2020-12-29T13:01:00","date_gmt":"2020-12-29T13:01:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=9645"},"modified":"2022-10-31T11:14:41","modified_gmt":"2022-10-31T11:14:41","slug":"loan-repayment-schedule","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/loan-repayment-schedule","title":{"rendered":"Loan Repayment Schedules and Their Effects"},"content":{"rendered":"\n<p>When taking a loan, you can negotiate with the lender and agree on how you will repay the money. Getting the best repayment terms will go a long way to ensure that you can settle the loan comfortably.<\/p>\n\n\n\n<p>Depending on what you are taking the loan for, you might be better off paying back the principal in one lump sum at the end of the loan tenure or chip off at it every month until the repayment period is complete.<\/p>\n\n\n\n<p>For instance, if you take a loan to finance your business startup, you might want to repay the principal at the end of a specified period and make monthly interest payments throughout the life of the loan. This agreement will allow your business the time it needs to stand on its feet and start yielding enough profit to pay back the principal.<\/p>\n\n\n\n<p>On the other hand, if you’ve taken a car loan, making principal +&nbsp;<a href=\"https:\/\/creditnigeria.com\/types-of-interest-rates-nigeria\">interest payments<\/a>&nbsp;every month would make sense for any salary earner.<\/p>\n\n\n\n<p>These arrangements are referred to as repayment schedules. Let’s take a look at how they affect your interest payments.<\/p>\n\n\n\n<h2>Amortized repayment schedule<\/h2>\n\n\n\n<p>For an amortized loan, payments are made in regular instalments that consist of both principal and interest. The interest to principal ratio is different for each month. Once the lender states your monthly payment, the repayment schedule is easy to calculate.<\/p>\n\n\n\n<p>Let’s say you want to take a loan of N 100,000 at an interest rate of 12% and a repayment period of 1 year. Going for an amortized repayment schedule with a fixed monthly payment of N 8,884.9, there’s a formula that will help you figure out the interest you will pay monthly for 12 months.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/media.graphcms.com\/CIPYrL1fT1Wmmhr7ZrL5\" alt=\"Amortized repayment schedule.png\" title=\"Amortized repayment schedule.png\"\/><\/figure>\n\n\n\n<p>The interest payment for the first month is calculated as follows: 12% (Interest rate) * N100,000 (Principal) \/ 12 months (loan tenure) = N1000.<\/p>\n\n\n\n<p>Subtracting N1,000 (Interest payment in Month 1) from N8884.9 (The stated monthly repayment) gives you N7,884.9, which is the principal repaid in Month 1. The principal repaid in Month 1 is then subtracted from the original amount you borrowed and carried down to Month 2.<\/p>\n\n\n\n<p>You will notice that the money channelled toward interest payments is greater at the beginning of the repayment period and steadily decreases as the loan tenure approaches its end.<\/p>\n\n\n\n<p>Conversely, the amount applied to principal payments is less at the beginning of the repayment period and keeps increasing as the loan tenure approaches its end.<\/p>\n\n\n\n<p>One advantage of loan amortization is that borrowers can pay off the principal in manageable bits. The total interest payment is reduced since the principal gets paid down throughout the lifetime of the loan. The 12% interest is made on the outstanding principal balance each month so that the actual cost of the loan would be the sum of the interest payments (N6,619) and not N 12,000 (12% of N 100,000) as you might expect.<\/p>\n\n\n\n<h2>Interest-only payments<\/h2>\n\n\n\n<p>In this repayment agreement, you only make interest payments throughout the loan tenure and then pay back the principal at the end of the term.<\/p>\n\n\n\n<p>Let us say you take N 100,000 at a 12% interest rate and 12 months repayment period. The repayment schedule would look like this:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/media.graphcms.com\/A2z8ipsrQ7mRr9u9l2UM\" alt=\"Interest only payments.png\" title=\"Interest only payments.png\"\/><\/figure>\n\n\n\n<p>As you can see, the monthly payment is specified by multiplying N 100,000 (the borrowed amount) by 12% and dividing the result by 12. The figures are purely interest payments from the 1st month to the 11th month. On the 12th month, you pay up the remaining interest in addition to the capital you borrowed.<\/p>\n\n\n\n<p>This type of agreement is beneficial when you want to take advantage of a venture that will yield a considerable profit at a later date, making it possible for you to repay the borrowed funds in one lump sum.<\/p>\n\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>Taking a loan entails an obligation to pay back, with interest. To ensure that you can make your payments comfortably, you need to discuss the repayment conditions with the lender. The purpose of the loan will determine the repayment method that will suit you well.<\/p>\n\n\n\n<p>If you need help finding a lender you can work with, use&nbsp;<a href=\"https:\/\/creditnigeria.com\/\">Credit Nigeria<\/a>. Credit Nigeria is an online loan marketplace. We link you to various lenders who can approve your loan application. Our service makes it possible for you to compare offers and choose your best fit.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When taking a loan, you can negotiate with the lender and agree on how you will repay the money. Getting<\/p>\n","protected":false},"author":2,"featured_media":9646,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9645"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=9645"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9645\/revisions"}],"predecessor-version":[{"id":9647,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9645\/revisions\/9647"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/9646"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=9645"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=9645"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=9645"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}