{"id":9651,"date":"2022-01-20T13:05:00","date_gmt":"2022-01-20T13:05:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=9651"},"modified":"2022-10-31T11:14:30","modified_gmt":"2022-10-31T11:14:30","slug":"get-a-loan-withouth-bvn","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/get-a-loan-withouth-bvn","title":{"rendered":"Is It Possible To Get A Loan Withouth A BVN?"},"content":{"rendered":"\n<p>A loan can be collected from different sources, and this is the major factor that will determine if a Bank Verification Number (BVN) is required or not.&nbsp;<\/p>\n\n\n\n<p>If the loan is collected from a friend or an association, you might not need a BVN because of the level of trust between you and your friend or the association.&nbsp;<strong>A BVN is however needed to get a&nbsp;<\/strong><a href=\"https:\/\/creditnigeria.com\/\"><strong>loan from banks<\/strong><\/a><strong>&nbsp;and other verified private money lenders in Nigeria.&nbsp;&nbsp;<\/strong><\/p>\n\n\n\n<p>This is as a result of an instruction from the&nbsp;<a href=\"https:\/\/nibss-plc.com.ng\/services\/bvn\" target=\"_blank\" rel=\"noopener\"><u>Nigeria Inter-Bank Settlement System Plc (NIBSS)<\/u><\/a>, that “<strong>individuals who are applying for loans must provide their Bank Verification Number to lenders so that their details can be confirmed from the Nigerian central database.”<\/strong><\/p>\n\n\n\n<h2>WHAT IS A BANK VERIFICATION NUMBER (BVN)<\/h2>\n\n\n\n<p><strong>A&nbsp;<\/strong><a href=\"https:\/\/nibss-plc.com.ng\/services\/bvn\" target=\"_blank\" rel=\"noopener\"><u><strong>Bank Verification Number (BVN)<\/strong><\/u><\/a><strong>&nbsp;is a code that identifies bank customers in Nigeria.<\/strong>&nbsp;This code is usually a set of numbers that is special for each customer; every customer that has registered and collected a BVN has a code that identifies only them.<\/p>\n\n\n\n<p>When used, the set of numbers provide fast and easy identification of the individual that they have been assigned to. This quick identification can be used to verify account details for banking, lending and other money related purposes.<\/p>\n\n\n\n<p>The identification system of the BVN is based on biometrics. Biometrics simply means the system uses physical features like fingerprints, facial features and the likes to confirm identity. In this case of the BVN, all 10 fingers and a facial image will be collected. Since every human being has a unique fingerprint (no two human beings can have the same fingerprints) it is an effective method of identification.<\/p>\n\n\n\n<p>The Central Bank of Nigeria worked with all Nigerian banks to create the BVN, this means that the BVN is not owned by any specific bank. A BVN can be used by all banks and authorised individuals to easily confirm the identity of the owner.&nbsp;<strong>Bank customers that have BVN’s enjoy a reduced risk of fraudulent activities on their accounts because only authorised banks and individuals have access to their bank accounts linked to their BVN.<\/strong><\/p>\n\n\n\n<h3>BENEFITS OF HAVING A BVN<\/h3>\n\n\n\n<p>As stated above the Bank Verification Number was created to increase the security of bank accounts in Nigeria, so there are many benefits to having it. The benefits include:&nbsp;<\/p>\n\n\n\n<ul><li>Account protection from fraudsters; the BVN keeps unauthorised individuals from gaining access to bank accounts of Nigerians<\/li><li>Unique identification;&nbsp; BVN makes it easy and fast to identify bank customers across all banks no matter the bank. It can be used as a means of Identification in any bank<\/li><li>Protection for money lenders; the BVN protects lenders from customers who only want to lend and not pay back. This is a major reason that most lenders require a BVN before giving out money<\/li><\/ul>\n\n\n\n<h2>WHY DO LENDERS NEED A BVN<\/h2>\n\n\n\n<p><strong>Lenders need your Bank Verification number (BVN) to confirm your identity.<\/strong>&nbsp;This provides them a form of safety net since they can use the BVN to check if you are who you really say you are. A BVN however cannot be used to access any bank account or be used to pay money into or collect money from any account by itself.<\/p>\n\n\n\n<p>A BVN can only be used to access information about the owner of a bank account to confirm personal details. This does not mean that you should not be careful with who you share the details of your BVN with because the information it provides can be used in negative ways.<\/p>\n\n\n\n<p>If you share your BVN with fraudsters, they cannot use the BVN alone to steal money from any of your accounts. But since the BVN can be used to check your identity details, they might try to use the knowledge of your identity to ask for your bank account details, ATM details and ATM pin. Once they have this, they can easily proceed to take money from your bank accounts.&nbsp;<\/p>\n\n\n\n<h2>HOW TO GET A BVN<\/h2>\n\n\n\n<p>A Bank Verification number can be obtained from any branch of any bank. You walk into the branch of any bank and tell the customer care representative that you want to get a Bank Verification Number.<\/p>\n\n\n\n<p>The customer care representative will present you with a BVN enrolment form which you have to fill right there with your personal details.<\/p>\n\n\n\n<p>After you fill out the form, your biometrics will be captured. This is usually your ten fingerprints and a photograph of you, which will be taken by the customer care representative.<\/p>\n\n\n\n<p>You will then be given a slip that confirms that you have enrolled for the BVN process. After a short period of time (from 24 hours to a few days), your BVN will be generated when the system confirms your application and you will receive the SMS to come back to the branch for pickup.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A loan can be collected from different sources, and this is the major factor that will determine if a Bank<\/p>\n","protected":false},"author":2,"featured_media":9652,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9651"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=9651"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9651\/revisions"}],"predecessor-version":[{"id":9653,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9651\/revisions\/9653"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/9652"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=9651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=9651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=9651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}