{"id":9654,"date":"2022-04-07T13:08:00","date_gmt":"2022-04-07T13:08:00","guid":{"rendered":"https:\/\/creditnigeria.com\/?p=9654"},"modified":"2022-10-31T11:14:22","modified_gmt":"2022-10-31T11:14:22","slug":"how-to-get-a-loan-in-nigeria","status":"publish","type":"post","link":"https:\/\/creditnigeria.com\/how-to-get-a-loan-in-nigeria","title":{"rendered":"How to get a loan in Nigeria"},"content":{"rendered":"\n<p>This is an easy to understand guide on “how to get a loan in Nigeria”. It is also a comprehensive guide, which means you will find what you need to know about taking loans in Nigeria here.<\/p>\n\n\n\n<p>Before you proceed to know how to get a loan in Nigeria, you must first understand what a loan is. If you already fully understand what a loan is, you can skip the “What Is A Loan” Section.&nbsp;<\/p>\n\n\n\n<h2>What is a loan?<\/h2>\n\n\n\n<p>A loan is money that is borrowed, which is repaid after an agreed amount of time with the specified interest on it. This interest is a percentage of the original amount borrowed.<\/p>\n\n\n\n<p>The amount of money borrowed is called the principal. For every month that passes after you’ve borrowed the money, a percentage of this principal will be added for you to pay back.&nbsp;<\/p>\n\n\n\n<p>The money added after each month for the entire period of the loan is called the interest.&nbsp;&nbsp;<\/p>\n\n\n\n<p>For example, if you were to take a loan of&nbsp; ₦100 Naira from any lender at 10% interest every month for 6 months, it means that 10% of ₦100 Naira&nbsp; (which is ₦10 Naira) would be added to the #100 Naira you borrowed every month for 6 months.<\/p>\n\n\n\n<p>This means that at the end of the 6 months you would have to pay back ₦160 Naira to the bank\/platform you borrowed money from. The principal is ₦100 Naira, while the interest is the extra ₦60 Naira after the 6 months period.&nbsp;<\/p>\n\n\n\n<h2>Where can you get a loan from in Nigeria<\/h2>\n\n\n\n<p>There are a lot of places to borrow money from in Nigeria.&nbsp;Here are a few of your options<em>:<\/em><\/p>\n\n\n\n<ul><li>Traditional Banks I.e&nbsp;<a href=\"https:\/\/www.gtbank.com\/personal-banking\/loans\" target=\"_blank\" rel=\"noopener\">GTbank<\/a>,&nbsp;<a href=\"https:\/\/www.zenithbank.com\/personal-banking\/loans\/\" target=\"_blank\" rel=\"noopener\">Zenith Bank<\/a>,&nbsp;<a href=\"https:\/\/www.firstbanknigeria.com\/personal\/loans\/\" target=\"_blank\" rel=\"noopener\">First Bank<\/a><\/li><li>Online Lenders I.e&nbsp;<a href=\"https:\/\/nmfb.com.ng\/\" target=\"_blank\" rel=\"noopener\">Nirsal<\/a>,&nbsp;<a href=\"https:\/\/www.renmoney.com\/\" target=\"_blank\" rel=\"noopener\">Renmoney<\/a><\/li><li>App Platforms from Google Play I.e FairMoney&nbsp;<\/li><\/ul>\n\n\n\n<h2>How can you get a loan in Nigeria? <\/h2>\n\n\n\n<p>Before you apply for a loan, you must know what you want to do with the loan. This will be very helpful because it will reduce the amount of interest you have to pay when paying back the loan.<\/p>\n\n\n\n<p>What do you need the loan for? Is it for personal issues? To buy a car? To pay rent or buy a new house? For your small business or just to have in case the salary does not come early.&nbsp;<\/p>\n\n\n\n<p>Asking these questions is always the best place to start from. As an example, if you need a loan to get a new car, you’re better off with a&nbsp;<a href=\"https:\/\/creditnigeria.com\/car-loan\">car loan<\/a><strong>&nbsp;<\/strong>that can use the car as collateral which would attract lesser interest than taking a&nbsp;<a href=\"https:\/\/creditnigeria.com\/personal-loan\">personal loan<\/a><strong>&nbsp;<\/strong>or an&nbsp;<a href=\"https:\/\/creditnigeria.com\/emergency-loan\">emergency loan<\/a><strong>&nbsp;<\/strong>to buy the car.&nbsp;<\/p>\n\n\n\n<h2>How can you actually get a loan?<\/h2>\n\n\n\n<p>There are many ways to access loans in Nigeria and the easiest kinds of loans you can get as of now are&nbsp;<a href=\"https:\/\/creditnigeria.com\/\">online Loans.<\/a><\/p>\n\n\n\n<p>With a simple search on the internet you can find a trusted online lender willing to offer you short term funds to cover emergencies. These kinds of loans usually take a few minutes to access and all you need for the application forms are a few details. Usually your:&nbsp;<\/p>\n\n\n\n<ul><li>Name<\/li><li>Bank Verification Number (BVN)<\/li><li>Bank Statement(sometimes)<\/li><li>Identification card – preferably a government-issued card.<\/li><li>Bank Account Details<\/li><\/ul>\n\n\n\n<p>After putting in the required details and the amount of loan you wish to take, the loan only takes a few minutes to be approved and you will receive the money into your bank account shortly after.&nbsp;<\/p>\n\n\n\n<p>Another way to get a loan is to physically visit the bank. Like most online platforms, Banks also have online sites where you can begin the process of taking a loan from. These bank websites also require you to fill and submit an application form that generally asks for:<\/p>\n\n\n\n<ul><li>A verifiable source of income I.e a savings account or a bank statement&nbsp;<\/li><li>A government-issued identification card&nbsp;<\/li><li>A utility Bill (like PHCN\/NEPA light bill)<\/li><li>Your Bank Verification Number<\/li><li>Reason for Loan<\/li><li>Payment Tenure<\/li><\/ul>\n\n\n\n<p>Some of these banks require you to have an account with them before accessing the loans while some do not.&nbsp;<\/p>\n\n\n\n<h2>Interest rates of loans in Nigeria<\/h2>\n\n\n\n<p>If you have read the ‘What Is A Loan’ section, you must have a basic understanding of what interest rates are.&nbsp;<\/p>\n\n\n\n<p>Different lenders have different interest rates depending on what kinds of loans you wish to take. These interest rates are also not fixed as it varies on several factors from salary range to the type of collateral involved. Collateral is a property offered in case the payment of the loan does not go as planned.<\/p>\n\n\n\n<p>Not everyone has collateral to offer, but the lack of collateral does not stop you from taking loans because there are online platforms willing to offer loans with no collateral involved. Five platforms that give loans without collateral include:<\/p>\n\n\n\n<ul><li>SMEDAN<\/li><li>AELLA-CREDIT<\/li><li>PAYLATER<\/li><li>ONE-FI<\/li><li>SPECTA<\/li><\/ul>\n\n\n\n<h2>Credit Nigeria find you loans easily<\/h2>\n\n\n\n<p>If you want to get the best collateral-free loan offers from trusted platforms, <a href=\"\/\">use Credit Nigeria<\/a>. Credit Nigeria is an online loan search platform that helps you search for the best available loans from trustworthy lenders without any collateral involved.<\/p>\n\n\n\n<p>Credit Nigeria will also help you compare all the available loan options for you, so you can choose the best loan option that fits your budget.&nbsp;Credit Nigeria is free and easy to use, with no hidden charges and no stress.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is an easy to understand guide on “how to get a loan in Nigeria”. It is also a comprehensive<\/p>\n","protected":false},"author":2,"featured_media":9655,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9654"}],"collection":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/comments?post=9654"}],"version-history":[{"count":1,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9654\/revisions"}],"predecessor-version":[{"id":9656,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/posts\/9654\/revisions\/9656"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media\/9655"}],"wp:attachment":[{"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/media?parent=9654"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/categories?post=9654"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/creditnigeria.com\/wp-json\/wp\/v2\/tags?post=9654"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}